{
  "backend/main.mo": "Main Motoko actor for the booking/leads backend, defining types and state for bookings, leads, user profiles, and service categories, with CRUD operations protected by role-based access control via MixinAuthorization.",
  "feature_evidence.json": "Feature evidence report documenting a single feature: restoring the application to version 17 state, listing all affected frontend files and component dependencies.",
  "frontend-file-summaries.txt": "A JSON document containing short descriptions of each frontend source file, serving as a reference summary of the frontend codebase's structure and purpose.",
  "frontend/admin-leads.html": "Empty HTML entry point file for the admin leads standalone application.",
  "frontend/admin.html": "Empty HTML entry point file for the standalone admin application.",
  "frontend/employee-leads.html": "Empty HTML entry point file for the employee leads standalone application.",
  "frontend/employee.html": "Empty HTML entry point file for the standalone employee application.",
  "frontend/index.css": "Base Tailwind CSS file defining OKLCH-based CSS custom properties for light and dark themes including background, foreground, primary, sidebar, and chart color tokens.",
  "frontend/index.html": "Main HTML entry point for the customer-facing app titled 'Naaz Studio - Makeup Booking', loading the React app via /src/main.tsx and including Google Fonts preconnect links.",
  "frontend/src/admin-leads-main.tsx": "Empty file for the admin leads application main entry point.",
  "frontend/src/admin-main.tsx": "Empty file for the admin application main entry point.",
  "frontend/src/AdminApp.tsx": "Empty file for the admin React application entry component.",
  "frontend/src/AdminLeadsApp.tsx": "Empty file for the admin leads React application entry component.",
  "frontend/src/App.tsx": "Customer-facing React app root that sets up TanStack Router with routes for home, services, booking, and booking-confirmation, wrapped in ThemeProvider and Toaster.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Empty file for the access denied screen component.",
  "frontend/src/components/AdminLayout.tsx": "Empty file for the admin layout wrapper component.",
  "frontend/src/components/AdminLeadsLayout.tsx": "Empty file for the admin leads layout wrapper component.",
  "frontend/src/components/AdminLeadsManagementTable.tsx": "Empty file for the admin leads management table component.",
  "frontend/src/components/AdminLeadsProtectedRoute.tsx": "Empty file for the admin leads protected route component.",
  "frontend/src/components/AdminLeadsTable.tsx": "Empty file for the admin leads table component.",
  "frontend/src/components/AdminProtectedRoute.tsx": "Empty file for the admin protected route component.",
  "frontend/src/components/EmployeeLayout.tsx": "Empty file for the employee layout wrapper component.",
  "frontend/src/components/EmployeeLeadsFilterPanel.tsx": "Empty file for the employee leads filter panel component.",
  "frontend/src/components/EmployeeLeadsLayout.tsx": "Empty file for the employee leads layout wrapper component.",
  "frontend/src/components/EmployeeLeadsProtectedRoute.tsx": "Empty file for the employee leads protected route component.",
  "frontend/src/components/EmployeeLeadsTable.tsx": "Empty file for the employee leads table component.",
  "frontend/src/components/EmployeeProtectedRoute.tsx": "Empty file for the employee protected route component.",
  "frontend/src/components/Layout.tsx": "Main customer-facing layout with a sticky header containing logo, navigation links, and login button, a footer with contact info and service area details, and a ProfileSetupModal triggered for authenticated users without a profile.",
  "frontend/src/components/LeadCaptureModal.tsx": "Dialog modal for capturing customer leads with name, phone, and email fields, pre-filled from user profile, submitting via the useCreateLead mutation with toast feedback.",
  "frontend/src/components/LeadsFilterPanel.tsx": "Empty file for the leads filter panel component.",
  "frontend/src/components/LeadsTable.tsx": "Empty file for the leads table component.",
  "frontend/src/components/LoginButton.tsx": "Renders a login/logout button using Internet Identity authentication, handling login, logout, and loading states with appropriate icons.",
  "frontend/src/components/PortfolioGallery.tsx": "Displays a responsive image grid gallery with a lightbox dialog for full-screen viewing and prev/next navigation.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog that collects a new user's name, email, and phone on first login and saves the profile via a mutation hook.",
  "frontend/src/components/ProtectedRoute.tsx": "A route guard component that blocks access for unauthenticated users or non-admins, showing appropriate error states or a loading spinner.",
  "frontend/src/components/ServiceCategoryCard.tsx": "A card component displaying a service category with an image, name, price, duration, and optional location overlaid on a gradient.",
  "frontend/src/components/TeamMemberProfile.tsx": "Displays a team member's name, role, bio, and a 2x2 grid of portfolio images in a responsive layout.",
  "frontend/src/employee-leads-main.tsx": "Empty entry point file, likely intended as the main module for the employee leads frontend app.",
  "frontend/src/employee-main.tsx": "Empty entry point file, likely intended as the main module for the employee frontend app.",
  "frontend/src/EmployeeApp.tsx": "Empty file for the employee React application entry component.",
  "frontend/src/EmployeeLeadsApp.tsx": "Empty file for the employee leads React application entry component.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous ICP backend actor using React Query, reinitializing and invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context with login, logout, and status tracking via an AuthClient, persisting identity across page reloads.",
  "frontend/src/hooks/useQueries.ts": "Exports React Query hooks for all backend interactions including user profiles, leads, bookings, and services, each wired to the actor from useActor.",
  "frontend/src/index.css": "Global CSS file that imports Google Fonts (Playfair Display, Cormorant Garamond, Inter), sets up Tailwind directives, and defines a rose-gold/cream beauty palette using CSS custom properties for both light and dark modes.",
  "frontend/src/main.tsx": "React app entry point that wraps the App component with QueryClientProvider (React Query) and InternetIdentityProvider before mounting to the DOM.",
  "frontend/src/pages/AdminBookingsPage.tsx": "Empty file with no content; placeholder for the admin bookings management page.",
  "frontend/src/pages/AdminLeadsDashboardPage.tsx": "Empty file with no content; placeholder for the admin leads dashboard page.",
  "frontend/src/pages/AdminLeadsLoginPage.tsx": "Empty file with no content; placeholder for the admin leads login page.",
  "frontend/src/pages/AdminLoginPage.tsx": "Empty file with no content; placeholder for the admin login page.",
  "frontend/src/pages/BookingConfirmationPage.tsx": "Displays a booking confirmation screen with a success icon, booking reference ID from URL search params, and navigation buttons to go home or book another appointment.",
  "frontend/src/pages/BookingPage.tsx": "Multi-field booking form page that lets users select a service, date, time slot, and enter contact details, then submits a booking via the createBooking mutation and redirects to the confirmation page.",
  "frontend/src/pages/EmployeeDashboardPage.tsx": "Empty file with no content; placeholder for the employee dashboard page.",
  "frontend/src/pages/EmployeeLeadsDashboardPage.tsx": "Empty file with no content; placeholder for the employee leads dashboard page.",
  "frontend/src/pages/EmployeeLeadsLoginPage.tsx": "Empty file with no content; placeholder for the employee leads login page.",
  "frontend/src/pages/EmployeeLoginPage.tsx": "Empty file with no content; placeholder for the employee login page.",
  "frontend/src/pages/HomePage.tsx": "Main landing page featuring a hero section, feature highlights, service previews grid, portfolio gallery, and team member profile for Naaz Studio.",
  "frontend/src/pages/ServicesPage.tsx": "Services listing page that displays a grid of makeup service category cards and opens a LeadCaptureModal when a category is clicked, with CTAs to navigate to the booking page.",
  "frontend/src/types/booking.ts": "TypeScript type definitions for bookings, re-exporting BookingStatus from backend types and defining interfaces for MakeupService and Booking.",
  "frontend/src/utils/urlParams.ts": "Utility function that reads a named parameter from either the URL query string or hash fragment, used to retrieve secret tokens passed via URL.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with CSS-variable-based oklch colors, custom fonts (Inter, Playfair Display, Cormorant Garamond), border radii, box shadows, and fade/slide animations.",
  "project_state.json": "Project state metadata file tracking the Naaz Studio project at schema version 1.0.0, recording one existing feature (restore to version 17) and no pending new feature requests."
}