{
  "backend/main.mo": "Main Motoko actor implementing makeup booking system with services, bookings, user profiles, time slot management, and role-based access control using MixinAuthorization.",
  "feature_evidence.json": "Feature evidence report documenting three implemented features for displaying service area information (Hyderabad, Secunderabad, and outskirts) across homepage and footer components.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files including components, pages, styles, and configuration with descriptions of their functionality and content.",
  "frontend/index.css": "Tailwind CSS base styles defining OKLCH color system variables for light and dark themes with beauty-industry aesthetic including rose gold and soft cream tones.",
  "frontend/index.html": "HTML entry point with title 'Naaz Studio - Makeup Booking' and root div for React application mounting.",
  "frontend/src/App.tsx": "Main React application component configuring TanStack Router with routes for home, services, booking, confirmation, and admin pages, wrapped in ThemeProvider with Toaster.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Access denied screen component displaying shield alert icon and message for unauthorized admin page access with navigation button to return home.",
  "frontend/src/components/Layout.tsx": "Application layout component with sticky header containing logo, navigation links, 24/7 badge, book button, login button, and footer displaying contact phone numbers with service area information and caffeine.ai attribution.",
  "frontend/src/components/LoginButton.tsx": "Authentication button component managing Internet Identity login/logout with loading states, error handling, and query cache clearing on logout.",
  "frontend/src/components/PortfolioGallery.tsx": "Reusable portfolio gallery component displaying images in responsive grid with hover effects and lightbox dialog for full-size image viewing.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that prompts authenticated users without a profile to enter their name, email, and phone number. Prevents dismissal until profile is completed.",
  "frontend/src/components/ProtectedRoute.tsx": "Route guard component that displays loading state during initialization, shows authentication prompt for unauthenticated users, and renders children only when authenticated.",
  "frontend/src/components/ServiceCategoryCard.tsx": "Card component displaying a service with image, name, description, duration, price, optional location, and a booking button. Features hover effects and gradient overlays.",
  "frontend/src/components/TeamMemberProfile.tsx": "Card component showing team member details (name, title, bio) alongside a 2x2 grid of portfolio images with hover effects.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance, handling authentication state changes and initializing access control with admin token from URL parameters.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login/logout flow, identity persistence, and authentication status states.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for all backend operations including services, bookings, time slots, user profiles, and admin functions with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom rose gold and cream color scheme defined as CSS variables for both light and dark modes.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/AdminBookingsPage.tsx": "Admin dashboard page for managing bookings with service selection, date picker (calendar), and table displaying bookings with status update controls. Includes access control check using useIsCallerAdmin hook.",
  "frontend/src/pages/BookingConfirmationPage.tsx": "Confirmation page displayed after successful booking, showing the booking ID and providing navigation buttons to return home or book another appointment.",
  "frontend/src/pages/BookingPage.tsx": "Main booking form page where users select a service, date, time slot, and enter contact information (pre-filled from user profile if available) to create an appointment.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero section, 24/7 availability badge, service area information, portfolio gallery, and team member profiles. Includes navigation to booking and services pages.",
  "frontend/src/pages/ServicesPage.tsx": "Displays all available services in a grid layout using ServiceCategoryCard components, with service-specific images and locations mapped based on service names.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support and parameter cleanup functionality.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining custom theme extensions including fonts (Inter, Playfair Display, Cormorant Garamond), OKLCH-based color system with CSS variables, custom shadows, border radius, and accordion animations.",
  "project_state.json": "Project state file tracking 19 versions of a makeup appointment booking website (Naaz Studio) with features including service listings, booking forms, admin views, homepage design, team profiles, and portfolio display."
}